In [1]:
import pandas as pd

In [3]:
fpath= './complex_students_2025_2.csv'
df_students = pd.read_csv(fpath)

In [5]:
df_students.head(2)

,Student_ID,First_Name,Last_Name,Full_Name,Gender,Birth_Date,Age,Enrollment_Date,Graduation_Date,Major,GPA,Math_Score,Math_Grade,English_Score,English_Grade,City,Extracurricular,Scholarship_Amount,Attendance_Rate,Year
0,0001-2025,Alex,Chan,Alex Chan,M,2002-03-15,23,2022-09-01,2026-06-30,Computer Science,3.45,85,B,78,B,Hong Kong,Sports,20000,0.92,NaN
1,0002-2025,Bella,Li,Bella Li,F,2001-07-22,23,2023-08-15,2027-06-30,Physics,3.82,92,A,88,B,Shanghai,Music,30000,0.95,NaN

In [6]:
df_students.pop('Year')

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
      ..
95   NaN
96   NaN
97   NaN
98   NaN
99   NaN
Name: Year, Length: 100, dtype: float64

In [7]:
df_students.head(2)

,Student_ID,First_Name,Last_Name,Full_Name,Gender,Birth_Date,Age,Enrollment_Date,Graduation_Date,Major,GPA,Math_Score,Math_Grade,English_Score,English_Grade,City,Extracurricular,Scholarship_Amount,Attendance_Rate
0,0001-2025,Alex,Chan,Alex Chan,M,2002-03-15,23,2022-09-01,2026-06-30,Computer Science,3.45,85,B,78,B,Hong Kong,Sports,20000,0.92
1,0002-2025,Bella,Li,Bella Li,F,2001-07-22,23,2023-08-15,2027-06-30,Physics,3.82,92,A,88,B,Shanghai,Music,30000,0.95

In [8]:
df_students.describe()

,Age,GPA,Math_Score,English_Score,Scholarship_Amount,Attendance_Rate
count,100.000000,100.000000,100.000000,100.000000,100.000000,100.000000
mean,22.490000,3.376900,83.660000,78.750000,19150.000000,0.907000
std,1.417745,0.379289,8.125555,8.202457,12654.200405,0.030863
min,20.000000,2.730000,69.000000,64.000000,0.000000,0.850000
25%,21.000000,2.987500,76.750000,71.750000,10000.000000,0.880000
50%,22.500000,3.420000,84.500000,79.500000,20000.000000,0.910000
75%,24.000000,3.725000,91.000000,86.000000,30000.000000,0.940000
max,25.000000,3.940000,96.000000,91.000000,40000.000000,0.950000

In [10]:
# mean of students' attendance rate
df_students['Attendance_Rate'].mean()

0.907

In [11]:
# mode of students' Math_Score
df_students['Math_Score'].mode()

0    70
1    87
2    90
3    91
4    94
Name: Math_Score, dtype: int64

In [12]:
df_students['Math_Score'].value_counts()

Math_Score
70    5
87    5
94    5
90    5
91    5
93    4
92    4
83    4
96    4
74    4
79    4
81    4
86    4
71    4
72    4
89    4
82    4
80    4
95    4
75    4
88    3
85    3
78    2
84    2
76    2
77    1
69    1
73    1
Name: count, dtype: int64

In [15]:
#Array of Major
print(df_students['Major'].unique())

['Computer Science' 'Physics' 'Mathematics' 'Biology' 'Engineering'
 'Economics' 'Chemistry']

In [27]:
print(f"\nLast Name:\n{df_students['Last_Name'].unique()} \nCounts of each Last Name:\n{df_students['Last_Name'].value_counts()}")

Last Name:
['Chan' 'Li' 'Wong' 'Zhang' 'Chen' 'Liu' 'Tan' 'Wu' 'Ho' 'Ma' 'Cheung'
 'Lau' 'Yang' 'Tsang' 'Chow' 'Fung' 'Kwok' 'Yip' 'Ng' 'Lam' 'Leung' 'Choi'
 'Hui' 'Tam' 'So' 'Poon' 'Cheng' 'Lai' 'Yau' 'Au']
Counts of each Last Name:
Last_Name
Fung      5
Lam       5
Yip       5
Kwok      5
Chow      5
Tsang     5
Yang      5
Lau       5
Cheung    5
Ng        5
Hui       4
Tam       4
So        4
Poon      4
Cheng     4
Leung     4
Lai       4
Yau       4
Choi      4
Au        4
Li        1
Ma        1
Ho        1
Wu        1
Tan       1
Liu       1
Chen      1
Zhang     1
Wong      1
Chan      1
Name: count, dtype: int64

In [30]:
#covariance matrix
df_students[['Math_Score','English_Score','Age']].cov()

               Math_Score  English_Score       Age
Math_Score      66.024646      66.540404  2.774343
English_Score   66.540404      67.280303  2.891414
Age              2.774343       2.891414  2.010000

In [32]:
df_students[['Math_Score','Attendance_Rate']].cov()

                 Math_Score  Attendance_Rate
Math_Score        66.024646         0.240384
Attendance_Rate    0.240384         0.000953

In [37]:
# correlation matrix
df_students[['Math_Score','English_Score','GPA','Attendance_Rate']].corr()

                 Math_Score  English_Score       GPA  Attendance_Rate
Math_Score         1.000000       0.998363  0.991129         0.958548
English_Score      0.998363       1.000000  0.990434         0.955028
GPA                0.991129       0.990434  1.000000         0.966327
Attendance_Rate    0.958548       0.955028  0.966327         1.000000